espressif/esp-idf/components/soc/esp32c6/register/soc/spi_mem_reg.h
#define SPI_MEM_INT_ST_REG(i)          (REG_SPI_MEM_BASE(i) + 0xCC)
/* SPI_MEM_BROWN_OUT_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_BROWN_OUT_INT interrupt..*/
#define SPI_MEM_BROWN_OUT_INT_ST    (BIT(10))
#define SPI_MEM_BROWN_OUT_INT_ST_M  (BIT(10))
#define SPI_MEM_BROWN_OUT_INT_ST_V  0x1
#define SPI_MEM_BROWN_OUT_INT_ST_S  10
/* SPI_MEM_AXI_WADDR_ERR_INT_ST : HRO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt..*/
#define SPI_MEM_AXI_WADDR_ERR_INT_ST    (BIT(9))
#define SPI_MEM_AXI_WADDR_ERR_INT_ST_M  (BIT(9))
#define SPI_MEM_AXI_WADDR_ERR_INT_ST_V  0x1
#define SPI_MEM_AXI_WADDR_ERR_INT_ST_S  9
/* SPI_MEM_AXI_WR_FLASH_ERR_INT_ST : HRO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt..*/
#define SPI_MEM_AXI_WR_FLASH_ERR_INT_ST    (BIT(8))
#define SPI_MEM_AXI_WR_FLASH_ERR_INT_ST_M  (BIT(8))
#define SPI_MEM_AXI_WR_FLASH_ERR_INT_ST_V  0x1
#define SPI_MEM_AXI_WR_FLASH_ERR_INT_ST_S  8
/* SPI_MEM_AXI_RADDR_ERR_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt..*/
#define SPI_MEM_AXI_RADDR_ERR_INT_ST    (BIT(7))
#define SPI_MEM_AXI_RADDR_ERR_INT_ST_M  (BIT(7))
#define SPI_MEM_AXI_RADDR_ERR_INT_ST_V  0x1
#define SPI_MEM_AXI_RADDR_ERR_INT_ST_S  7
/* SPI_MEM_PMS_REJECT_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_PMS_REJECT_INT interrupt..*/
#define SPI_MEM_PMS_REJECT_INT_ST    (BIT(6))
#define SPI_MEM_PMS_REJECT_INT_ST_M  (BIT(6))
#define SPI_MEM_PMS_REJECT_INT_ST_V  0x1
#define SPI_MEM_PMS_REJECT_INT_ST_S  6
/* SPI_MEM_ECC_ERR_INT_ST : HRO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_ECC_ERR_INT interrupt..*/
#define SPI_MEM_ECC_ERR_INT_ST    (BIT(5))
#define SPI_MEM_ECC_ERR_INT_ST_M  (BIT(5))
#define SPI_MEM_ECC_ERR_INT_ST_V  0x1
#define SPI_MEM_ECC_ERR_INT_ST_S  5
/* SPI_MEM_MST_ST_END_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_MST_ST_END_INT interrupt..*/
#define SPI_MEM_MST_ST_END_INT_ST    (BIT(4))
#define SPI_MEM_MST_ST_END_INT_ST_M  (BIT(4))
#define SPI_MEM_MST_ST_END_INT_ST_V  0x1
#define SPI_MEM_MST_ST_END_INT_ST_S  4
/* SPI_MEM_SLV_ST_END_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_SLV_ST_END_INT interrupt..*/
#define SPI_MEM_SLV_ST_END_INT_ST    (BIT(3))
#define SPI_MEM_SLV_ST_END_INT_ST_M  (BIT(3))
#define SPI_MEM_SLV_ST_END_INT_ST_V  0x1
#define SPI_MEM_SLV_ST_END_INT_ST_S  3
/* SPI_MEM_WPE_END_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_WPE_END_INT interrupt..*/
#define SPI_MEM_WPE_END_INT_ST    (BIT(2))
#define SPI_MEM_WPE_END_INT_ST_M  (BIT(2))
#define SPI_MEM_WPE_END_INT_ST_V  0x1
#define SPI_MEM_WPE_END_INT_ST_S  2
/* SPI_MEM_PES_END_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_PES_END_INT interrupt..*/
#define SPI_MEM_PES_END_INT_ST    (BIT(1))
#define SPI_MEM_PES_END_INT_ST_M  (BIT(1))
#define SPI_MEM_PES_END_INT_ST_V  0x1
#define SPI_MEM_PES_END_INT_ST_S  1
/* SPI_MEM_PER_END_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_PER_END_INT interrupt..*/
#define SPI_MEM_PER_END_INT_ST    (BIT(0))
#define SPI_MEM_PER_END_INT_ST_M  (BIT(0))
#define SPI_MEM_PER_END_INT_ST_V  0x1
#define SPI_MEM_PER_END_INT_ST_S  0

#define SPI_MEM_DDR_REG(i)          (REG_SPI_MEM_BASE(i) + 0xD4)
/* SPI_MEM_FMEM_HYPERBUS_CA : HRO ;bitpos:[30] ;default: 1'b0 ; */
/*description: Set this bit to enable HyperRAM address out when accesses to flash, which means
ADDR_OUT[31:0] = {spi_usr_addr_value[19:4], 13'd0, spi_usr_addr_value[3:1]}..*/
#define SPI_MEM_FMEM_HYPERBUS_CA    (BIT(30))
#define SPI_MEM_FMEM_HYPERBUS_CA_M  (BIT(30))
#define SPI_MEM_FMEM_HYPERBUS_CA_V  0x1
#define SPI_MEM_FMEM_HYPERBUS_CA_S  30
/* SPI_MEM_FMEM_OCTA_RAM_ADDR : HRO ;bitpos:[29] ;default: 1'b0 ; */
/*description: Set this bit to enable octa_ram address out when accesses to flash, which means
ADDR_OUT[31:0] = {spi_usr_addr_value[25:4], 6'd0, spi_usr_addr_value[3:1], 1'b0}
..*/
#define SPI_MEM_FMEM_OCTA_RAM_ADDR    (BIT(29))
#define SPI_MEM_FMEM_OCTA_RAM_ADDR_M  (BIT(29))
#define SPI_MEM_FMEM_OCTA_RAM_ADDR_V  0x1
#define SPI_MEM_FMEM_OCTA_RAM_ADDR_S  29
/* SPI_MEM_FMEM_CLK_DIFF_INV : HRO ;bitpos:[28] ;default: 1'b0 ; */
/*description: Set this bit to invert SPI_DIFF when accesses to flash. ..*/
#define SPI_MEM_FMEM_CLK_DIFF_INV    (BIT(28))
#define SPI_MEM_FMEM_CLK_DIFF_INV_M  (BIT(28))
#define SPI_MEM_FMEM_CLK_DIFF_INV_V  0x1
#define SPI_MEM_FMEM_CLK_DIFF_INV_S  28
/* SPI_MEM_FMEM_HYPERBUS_DUMMY_2X : HRO ;bitpos:[27] ;default: 1'b0 ; */
/*description: Set this bit to enable the vary dummy function in SPI HyperBus mode, when SPI0 a
ccesses flash or SPI1 accesses flash or sram..*/
#define SPI_MEM_FMEM_HYPERBUS_DUMMY_2X    (BIT(27))
#define SPI_MEM_FMEM_HYPERBUS_DUMMY_2X_M  (BIT(27))
#define SPI_MEM_FMEM_HYPERBUS_DUMMY_2X_V  0x1
#define SPI_MEM_FMEM_HYPERBUS_DUMMY_2X_S  27
/* SPI_MEM_FMEM_DQS_CA_IN : HRO ;bitpos:[26] ;default: 1'b0 ; */
/*description: Set this bit to enable the input of SPI_DQS signal in SPI phases of CMD and ADDR
..*/
#define SPI_MEM_FMEM_DQS_CA_IN    (BIT(26))
#define SPI_MEM_FMEM_DQS_CA_IN_M  (BIT(26))
#define SPI_MEM_FMEM_DQS_CA_IN_V  0x1
#define SPI_MEM_FMEM_DQS_CA_IN_S  26
/* SPI_MEM_FMEM_CLK_DIFF_EN : HRO ;bitpos:[24] ;default: 1'b0 ; */
/*description: Set this bit to enable the differential SPI_CLK#..*/
#define SPI_MEM_FMEM_CLK_DIFF_EN    (BIT(24))
#define SPI_MEM_FMEM_CLK_DIFF_EN_M  (BIT(24))
#define SPI_MEM_FMEM_CLK_DIFF_EN_V  0x1
#define SPI_MEM_FMEM_CLK_DIFF_EN_S  24
/* SPI_MEM_FMEM_DDR_DQS_LOOP : HRO ;bitpos:[21] ;default: 1'b0 ; */
/*description: 1: Do not need the input of SPI_DQS signal, SPI0 starts to receive data when spi
0_slv_st is in SPI_MEM_DIN state. It is used when there is no SPI_DQS signal or
SPI_DQS signal is not stable. 0: SPI0 starts to store data at the positive and n
egative edge of SPI_DQS..*/
#define SPI_MEM_FMEM_DDR_DQS_LOOP    (BIT(21))
#define SPI_MEM_FMEM_DDR_DQS_LOOP_M  (BIT(21))
#define SPI_MEM_FMEM_DDR_DQS_LOOP_V  0x1
#define SPI_MEM_FMEM_DDR_DQS_LOOP_S  21
/* SPI_MEM_FMEM_USR_DDR_DQS_THD : HRO ;bitpos:[20:14] ;default: 7'b0 ; */
/*description: The delay number of data strobe which from memory based on SPI clock..*/
#define SPI_MEM_FMEM_USR_DDR_DQS_THD    0x0000007F
#define SPI_MEM_FMEM_USR_DDR_DQS_THD_M  ((SPI_MEM_FMEM_USR_DDR_DQS_THD_V)<<(SPI_MEM_FMEM_USR_DDR_DQS_THD_S))
#define SPI_MEM_FMEM_USR_DDR_DQS_THD_V  0x7F
#define SPI_MEM_FMEM_USR_DDR_DQS_THD_S  14
/* SPI_MEM_FMEM_RX_DDR_MSK_EN : HRO ;bitpos:[13] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in SPI0 ECC DDR read mode, when
accesses to flash..*/
#define SPI_MEM_FMEM_RX_DDR_MSK_EN    (BIT(13))
#define SPI_MEM_FMEM_RX_DDR_MSK_EN_M  (BIT(13))
#define SPI_MEM_FMEM_RX_DDR_MSK_EN_V  0x1
#define SPI_MEM_FMEM_RX_DDR_MSK_EN_S  13
/* SPI_MEM_FMEM_TX_DDR_MSK_EN : HRO ;bitpos:[12] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in SPI0 ECC DDR write mode, when
 accesses to flash..*/
#define SPI_MEM_FMEM_TX_DDR_MSK_EN    (BIT(12))
#define SPI_MEM_FMEM_TX_DDR_MSK_EN_M  (BIT(12))
#define SPI_MEM_FMEM_TX_DDR_MSK_EN_V  0x1
#define SPI_MEM_FMEM_TX_DDR_MSK_EN_S  12
/* SPI_MEM_FMEM_OUTMINBYTELEN : HRO ;bitpos:[11:5] ;default: 7'b1 ; */
/*description: It is the minimum output data length in the panda device..*/
#define SPI_MEM_FMEM_OUTMINBYTELEN    0x0000007F
#define SPI_MEM_FMEM_OUTMINBYTELEN_M  ((SPI_MEM_FMEM_OUTMINBYTELEN_V)<<(SPI_MEM_FMEM_OUTMINBYTELEN_S))
#define SPI_MEM_FMEM_OUTMINBYTELEN_V  0x7F
#define SPI_MEM_FMEM_OUTMINBYTELEN_S  5
/* SPI_MEM_FMEM_DDR_CMD_DIS : HRO ;bitpos:[4] ;default: 1'b0 ; */
/*description: the bit is used to disable dual edge in command phase when DDR mode..*/
#define SPI_MEM_FMEM_DDR_CMD_DIS    (BIT(4))
#define SPI_MEM_FMEM_DDR_CMD_DIS_M  (BIT(4))
#define SPI_MEM_FMEM_DDR_CMD_DIS_V  0x1
#define SPI_MEM_FMEM_DDR_CMD_DIS_S  4
/* SPI_MEM_FMEM_DDR_WDAT_SWP : HRO ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set the bit to reorder tx data of the word in spi DDR mode..*/
#define SPI_MEM_FMEM_DDR_WDAT_SWP    (BIT(3))
#define SPI_MEM_FMEM_DDR_WDAT_SWP_M  (BIT(3))
#define SPI_MEM_FMEM_DDR_WDAT_SWP_V  0x1
#define SPI_MEM_FMEM_DDR_WDAT_SWP_S  3
/* SPI_MEM_FMEM_DDR_RDAT_SWP : HRO ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set the bit to reorder rx data of the word in spi DDR mode..*/
#define SPI_MEM_FMEM_DDR_RDAT_SWP    (BIT(2))
#define SPI_MEM_FMEM_DDR_RDAT_SWP_M  (BIT(2))
#define SPI_MEM_FMEM_DDR_RDAT_SWP_V  0x1
#define SPI_MEM_FMEM_DDR_RDAT_SWP_S  2
/* SPI_MEM_FMEM_VAR_DUMMY : HRO ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set the bit to enable variable dummy cycle in spi DDR mode..*/
#define SPI_MEM_FMEM_VAR_DUMMY    (BIT(1))
#define SPI_MEM_FMEM_VAR_DUMMY_M  (BIT(1))
#define SPI_MEM_FMEM_VAR_DUMMY_V  0x1
#define SPI_MEM_FMEM_VAR_DUMMY_S  1
/* SPI_MEM_FMEM_DDR_EN : HRO ;bitpos:[0] ;default: 1'b0 ; */
/*description: 1: in DDR mode,  0 in SDR mode.*/
#define SPI_MEM_FMEM_DDR_EN    (BIT(0))
#define SPI_MEM_FMEM_DDR_EN_M  (BIT(0))
#define SPI_MEM_FMEM_DDR_EN_V  0x1
#define SPI_MEM_FMEM_DDR_EN_S  0

#define SPI_MEM_SPI_SMEM_DDR_REG(i)          (REG_SPI_MEM_BASE(i) + 0xD8)
/* SPI_MEM_SMEM_HYPERBUS_CA : HRO ;bitpos:[30] ;default: 1'b0 ; */
/*description: Set this bit to enable HyperRAM address out when accesses to external RAM, which
 means ADDR_OUT[31:0] = {spi_usr_addr_value[19:4], 13'd0, spi_usr_addr_value[3:1
]}..*/
#define SPI_MEM_SMEM_HYPERBUS_CA    (BIT(30))
#define SPI_MEM_SMEM_HYPERBUS_CA_M  (BIT(30))
#define SPI_MEM_SMEM_HYPERBUS_CA_V  0x1
#define SPI_MEM_SMEM_HYPERBUS_CA_S  30
/* SPI_MEM_SMEM_OCTA_RAM_ADDR : HRO ;bitpos:[29] ;default: 1'b0 ; */
/*description: Set this bit to enable octa_ram address out when accesses to external RAM, which
 means ADDR_OUT[31:0] = {spi_usr_addr_value[25:4], 6'd0, spi_usr_addr_value[3:1]
, 1'b0}..*/
#define SPI_MEM_SMEM_OCTA_RAM_ADDR    (BIT(29))
#define SPI_MEM_SMEM_OCTA_RAM_ADDR_M  (BIT(29))
#define SPI_MEM_SMEM_OCTA_RAM_ADDR_V  0x1
#define SPI_MEM_SMEM_OCTA_RAM_ADDR_S  29
/* SPI_MEM_SMEM_CLK_DIFF_INV : HRO ;bitpos:[28] ;default: 1'b0 ; */
/*description: Set this bit to invert SPI_DIFF when accesses to external RAM. ..*/
#define SPI_MEM_SMEM_CLK_DIFF_INV    (BIT(28))
#define SPI_MEM_SMEM_CLK_DIFF_INV_M  (BIT(28))
#define SPI_MEM_SMEM_CLK_DIFF_INV_V  0x1
#define SPI_MEM_SMEM_CLK_DIFF_INV_S  28
/* SPI_MEM_SMEM_HYPERBUS_DUMMY_2X : HRO ;bitpos:[27] ;default: 1'b0 ; */
/*description: Set this bit to enable the vary dummy function in SPI HyperBus mode, when SPI0 a
ccesses flash or SPI1 accesses flash or sram..*/
#define SPI_MEM_SMEM_HYPERBUS_DUMMY_2X    (BIT(27))
#define SPI_MEM_SMEM_HYPERBUS_DUMMY_2X_M  (BIT(27))
#define SPI_MEM_SMEM_HYPERBUS_DUMMY_2X_V  0x1
#define SPI_MEM_SMEM_HYPERBUS_DUMMY_2X_S  27
/* SPI_MEM_SMEM_DQS_CA_IN : HRO ;bitpos:[26] ;default: 1'b0 ; */
/*description: Set this bit to enable the input of SPI_DQS signal in SPI phases of CMD and ADDR
..*/
#define SPI_MEM_SMEM_DQS_CA_IN    (BIT(26))
#define SPI_MEM_SMEM_DQS_CA_IN_M  (BIT(26))
#define SPI_MEM_SMEM_DQS_CA_IN_V  0x1
#define SPI_MEM_SMEM_DQS_CA_IN_S  26
/* SPI_MEM_SMEM_CLK_DIFF_EN : HRO ;bitpos:[24] ;default: 1'b0 ; */
/*description: Set this bit to enable the differential SPI_CLK#..*/
#define SPI_MEM_SMEM_CLK_DIFF_EN    (BIT(24))
#define SPI_MEM_SMEM_CLK_DIFF_EN_M  (BIT(24))
#define SPI_MEM_SMEM_CLK_DIFF_EN_V  0x1
#define SPI_MEM_SMEM_CLK_DIFF_EN_S  24
/* SPI_MEM_SMEM_DDR_DQS_LOOP : HRO ;bitpos:[21] ;default: 1'b0 ; */
/*description: 1: Do not need the input of SPI_DQS signal, SPI0 starts to receive data when spi
0_slv_st is in SPI_MEM_DIN state. It is used when there is no SPI_DQS signal or
SPI_DQS signal is not stable. 0: SPI0 starts to store data at the positive and n
egative edge of SPI_DQS..*/
#define SPI_MEM_SMEM_DDR_DQS_LOOP    (BIT(21))
#define SPI_MEM_SMEM_DDR_DQS_LOOP_M  (BIT(21))
#define SPI_MEM_SMEM_DDR_DQS_LOOP_V  0x1
#define SPI_MEM_SMEM_DDR_DQS_LOOP_S  21
/* SPI_MEM_SMEM_USR_DDR_DQS_THD : HRO ;bitpos:[20:14] ;default: 7'b0 ; */
/*description: The delay number of data strobe which from memory based on SPI clock..*/
#define SPI_MEM_SMEM_USR_DDR_DQS_THD    0x0000007F
#define SPI_MEM_SMEM_USR_DDR_DQS_THD_M  ((SPI_MEM_SMEM_USR_DDR_DQS_THD_V)<<(SPI_MEM_SMEM_USR_DDR_DQS_THD_S))
#define SPI_MEM_SMEM_USR_DDR_DQS_THD_V  0x7F
#define SPI_MEM_SMEM_USR_DDR_DQS_THD_S  14
/* SPI_MEM_SMEM_RX_DDR_MSK_EN : HRO ;bitpos:[13] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in SPI0 ECC DDR read mode, when
accesses to external RAM..*/
#define SPI_MEM_SMEM_RX_DDR_MSK_EN    (BIT(13))
#define SPI_MEM_SMEM_RX_DDR_MSK_EN_M  (BIT(13))
#define SPI_MEM_SMEM_RX_DDR_MSK_EN_V  0x1
#define SPI_MEM_SMEM_RX_DDR_MSK_EN_S  13
/* SPI_MEM_SMEM_TX_DDR_MSK_EN : HRO ;bitpos:[12] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in SPI0 ECC DDR write mode, when
 accesses to external RAM..*/
#define SPI_MEM_SMEM_TX_DDR_MSK_EN    (BIT(12))
#define SPI_MEM_SMEM_TX_DDR_MSK_EN_M  (BIT(12))
#define SPI_MEM_SMEM_TX_DDR_MSK_EN_V  0x1
#define SPI_MEM_SMEM_TX_DDR_MSK_EN_S  12
/* SPI_MEM_SMEM_OUTMINBYTELEN : HRO ;bitpos:[11:5] ;default: 7'b1 ; */
/*description: It is the minimum output data length in the DDR psram..*/
#define SPI_MEM_SMEM_OUTMINBYTELEN    0x0000007F
#define SPI_MEM_SMEM_OUTMINBYTELEN_M  ((SPI_MEM_SMEM_OUTMINBYTELEN_V)<<(SPI_MEM_SMEM_OUTMINBYTELEN_S))
#define SPI_MEM_SMEM_OUTMINBYTELEN_V  0x7F
#define SPI_MEM_SMEM_OUTMINBYTELEN_S  5
/* SPI_MEM_SMEM_DDR_CMD_DIS : HRO ;bitpos:[4] ;default: 1'b0 ; */
/*description: the bit is used to disable dual edge in command phase when DDR mode..*/
#define SPI_MEM_SMEM_DDR_CMD_DIS    (BIT(4))
#define SPI_MEM_SMEM_DDR_CMD_DIS_M  (BIT(4))
#define SPI_MEM_SMEM_DDR_CMD_DIS_V  0x1
#define SPI_MEM_SMEM_DDR_CMD_DIS_S  4
/* SPI_MEM_SMEM_DDR_WDAT_SWP : HRO ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set the bit to reorder tx data of the word in spi DDR mode..*/
#define SPI_MEM_SMEM_DDR_WDAT_SWP    (BIT(3))
#define SPI_MEM_SMEM_DDR_WDAT_SWP_M  (BIT(3))
#define SPI_MEM_SMEM_DDR_WDAT_SWP_V  0x1
#define SPI_MEM_SMEM_DDR_WDAT_SWP_S  3
/* SPI_MEM_SMEM_DDR_RDAT_SWP : HRO ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set the bit to reorder rx data of the word in spi DDR mode..*/
#define SPI_MEM_SMEM_DDR_RDAT_SWP    (BIT(2))
#define SPI_MEM_SMEM_DDR_RDAT_SWP_M  (BIT(2))
#define SPI_MEM_SMEM_DDR_RDAT_SWP_V  0x1
#define SPI_MEM_SMEM_DDR_RDAT_SWP_S  2
/* SPI_MEM_SMEM_VAR_DUMMY : HRO ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set the bit to enable variable dummy cycle in spi DDR mode..*/
#define SPI_MEM_SMEM_VAR_DUMMY    (BIT(1))
#define SPI_MEM_SMEM_VAR_DUMMY_M  (BIT(1))
#define SPI_MEM_SMEM_VAR_DUMMY_V  0x1
#define SPI_MEM_SMEM_VAR_DUMMY_S  1
/* SPI_MEM_SMEM_DDR_EN : HRO ;bitpos:[0] ;default: 1'b0 ; */
/*description: 1: in DDR mode,  0 in SDR mode.*/
#define SPI_MEM_SMEM_DDR_EN    (BIT(0))
#define SPI_MEM_SMEM_DDR_EN_M  (BIT(0))
#define SPI_MEM_SMEM_DDR_EN_V  0x1
#define SPI_MEM_SMEM_DDR_EN_S  0

